Repository: Asseel-Naji/kopypast
Catalog: translate/*.po
Languages: ru

source: Snippets
ru: Сниппеты

source: General
ru: Основное

source: Backup Snippets
ru: Сохранить

source: Restore Snippets
ru: Восстановить

source: Backup contains no snippets
ru: Резервная копия не содержит сниппетов

source: Invalid snippet format
ru: Неверный формат сниппета

source: All snippets are duplicates
ru: Все сниппеты уже добавлены

source: Cannot restore snippets: maximum limit (%1) reached
ru: Невозможно восстановить сниппеты: достигнут предел (%1)

source: Only restored %1 snippet due to maximum limit
ru: Восстановлен только %1 сниппет из-за ограничения

source: Restored %1 snippet, skipped %2 duplicate(s)
ru: Восстановлен %1 сниппет, пропущено %2 дубликат(а)

source: Successfully restored %1 snippet
ru: Успешно восстановлен %1 сниппет

source: Invalid backup format
ru: Неверный формат резервной копии

source: Copy and save the contents below to back up your snippets:
ru: Скопируйте приведённый ниже текст для создания резервной копии:

source: Paste the backup contents below to restore your snippets:
ru: Вставьте содержимое резервной копии ниже для восстановления:

source: Backup Contents
ru: Содержимое резервной копии

source: Copy
ru: Копировать

source: Appearance
ru: Внешний вид

source: Configure how the widget looks
ru: Настройте визуальное представление виджета

source: Monochrome icon
ru: Монохромная иконка

source: Use a monochrome icon that matches the color scheme
ru: Использовать монохромную иконку для соответствия теме

source: Enable search bar
ru: Включить панель поиска

source: Show a search field at the top of the widget
ru: Отображать панель поиска в верхней части виджета

source: Show bottom toolbar
ru: Показать панель инструментов

source: Place a toolbar with counter and buttons at the bottom
ru: Разместить панель инструментов в нижней части виджета

source: Hide snippet previews
ru: Скрыть предпросмотр

source: Show only snippet titles without content previews
ru: Отображать только заголовки сниппетов без содержания

source: Functionality
ru: Функциональность

source: Configure behavior and limitations
ru: Настройте поведение и ограничения виджета

source: Maximum number of snippets:
ru: Максимальное число сниппетов:

source: Limit the number of snippets for optimal performance
ru: Ограничьте количество сниппетов для производительности

source: Keyboard navigation
ru: Клавиатурная навигация

source: Use the keyboard keys to navigate and select snippets
ru: Использовать клавиши управления для навигации и выбора

source: No snippets added
ru: Сниппеты не добавлены

source: Add your first snippet using the button below
ru: Добавьте сниппет, используя кнопку ниже

source: Edit
ru: Изменить

source: Delete
ru: Удалить

source: Add Snippet
ru: Добавить

source: Maximum limit reached
ru: Достигнут заданный предел

source: Backup
ru: Сохранить

source: Restore
ru: Восстановить

source: Search for snippets...
ru: Поиск по сниппетам...

source: No snippets available
ru: Нет доступных сниппетов

source: Add snippets in the settings
ru: Добавьте сниппеты в настройках

source: No matching snippets
ru: Нет подходящих сниппетов

source: Try a different search term
ru: Попробуйте другой поисковый запрос

source: %1 snippet
ru: %1 сниппет

source: Copied!
ru: Скопировано!

source: Configure
ru: Настроить

source: Keep Open
ru: Не закрывать

source: Edit Snippet
ru: Изменить

source: Snippet Title
ru: Название

source: Snippet Text
ru: Содержание
